{"timestamp": 1768885893.998872, "results": [{"id": 28931911, "slug": "Israel-Might-Become-a-Bitcoin-Nation-Heres-Whats-Changing", "title": "Israel Might Become a Bitcoin Nation — Here’s What’s Changing", "description": "Israel is steadily moving closer to becoming a Bitcoin-friendly nation. Not through dramatic announcements, but through deliberate regulatory and financial shifts. What many once treated as a speculative fringe technology now commands serious attention from lawmakers, regulators, and financial institutions", "published_at": "2026-01-18T22:33:23Z", "created_at": "2026-01-18T22:33:23+00:00", "kind": "news"}, {"id": 28925779, "slug": "Bullish-Analyst-Tom-Lee-Says-Ethereum-Will-Outperform-Bitcoin-Explains-His-Expectations", "title": "Bullish Analyst Tom Lee Says, ‘Ethereum Will Outperform Bitcoin,’ Explains His Expectations", "description": "Tom Lee, chairman of Bitmine, has released a new interview outlining his expectations for Bitcoin and Ethereum. Continue Reading: Bullish Analyst Tom Lee Says, ‘Ethereum Will Outperform Bitcoin,’ Explains His Expectations", "published_at": "2026-01-18T14:58:09Z", "created_at": "2026-01-18T14:58:09+00:00", "kind": "news"}, {"id": 28871132, "slug": "Controversial-Economist-Issues-New-Bitcoin-Crash-Warning", "title": "Controversial Economist Issues New Bitcoin Crash Warning", "description": "Longtime gold advocate and Bitcoin (BTC) critic Peter Schiff is once again issuing a stark warning to investors, and this time, he says major moves are coming across both precious metals and cryptocurrency markets. Specifically, in a post shared on X on January 16, Schiff warned that investors need to prepare for significant volatility ahead. com", "published_at": "2026-01-16T10:09:11Z", "created_at": "2026-01-16T10:09:11+00:00", "kind": "news"}, {"id": 28852005, "slug": "Arthur-Hayes-Liquidity-Sets-Bitcoin-Up-for-New-Highs-in-2026", "title": "Arthur Hayes: Liquidity Sets Bitcoin Up for New Highs in 2026", "description": "Bitcoin could be poised for fresh all-time highs in 2026, according to BitMEX co-founder Arthur Hayes. His comments come after a difficult 2025 that saw the asset lag behind other major markets. His analysis is centered on macro liquidity conditions, particularly the availability of U. S", "published_at": "2026-01-15T19:31:16Z", "created_at": "2026-01-15T19:31:16+00:00", "kind": "news"}, {"id": 28850630, "slug": "Bitcoin-Pauses-Below-97K-as-Momentum-Cools", "title": "Bitcoin Pauses Below $97K as Momentum Cools", "description": "Bitcoin slowed today after a strong multi-week climb, trading around $96. 6K and printing a small daily pullback on the chart. However, that kind of stall is common when the price reaches the upper edge of a range, and short-term traders rotate risk, especially with BTC still below the psychological $100K level", "published_at": "2026-01-15T18:41:45Z", "created_at": "2026-01-15T18:41:45+00:00", "kind": "news"}, {"id": 28816897, "slug": "Crypto-Rally-Triggers-718M-Short-Liquidation-Event", "title": "Crypto Rally Triggers $718M Short Liquidation Event", "description": "More than $718 million in short positions were wiped out across the crypto market in the past 24 hours. Marking the largest short liquidation event since October&#8217;s market crash, according to liquidation and derivatives data. The move coincided with sharp upside momentum in Bitcoin and Ethereum", "published_at": "2026-01-14T19:44:10Z", "created_at": "2026-01-14T19:44:10+00:00", "kind": "news"}, {"id": 28738700, "slug": "Why-A-DOJ-Probe-On-The-Fed-Could-Boost-Bitcoin", "title": "Why A DOJ Probe On The Fed Could Boost Bitcoin", "description": "⚡ KEY TAKEAWAYS A DOJ probe has put the Federal Reserve under political and legal pressure. Markets reacted with weaker stocks and stronger gold and Bitcoin. Bitcoin is being viewed as a hedge against fiat-system instability. The U", "published_at": "2026-01-12T14:26:55Z", "created_at": "2026-01-12T14:26:55+00:00", "kind": "news"}, {"id": 28736920, "slug": "Standard-Chartered-says-2026-will-be-the-year-of-Ethereum-as-bank-backs-ETH-outperformance", "title": "Standard Chartered says ‘2026 will be the year of Ethereum’ as bank backs ETH outperformance", "description": "Standard Chartered forecasts Ethereum outperformance versus Bitcoin, citing network effects and growing real-world asset adoption.", "published_at": "2026-01-12T13:34:37Z", "created_at": "2026-01-12T13:34:37+00:00", "kind": "news"}]}